# Easy:

# 1.  ჩამოთვალე და კომენტარების მეშვეობით ახსენი პითონში არსებული 3 ინფორმაციის ტიპი (int, float, str).

# str(string) - სტრინგში შეიძლება იყოს სიმბოლოები წინადადებები ან სხვა მაგალითად პითონში ს=სტრინგი შეიძლება იყოს ასე: "Hello, World"
#
# float - ფლოუთი არის მონაცემთა ტიპი რომელიც წარმოადგენს ათწილადურ რიცხვებს მაგალითად და მათემატიკურ ოპერაციებში გამოიყენება მაგ: 3.14, 0.001 და ასე შემდეგ
#
# int(integer) -ინტეჯერში შედის ის რიცხვები რომლებიც არ არიან ათლიწადები. პითონში ინტეჯერი გამოიყენება მარტივ გამოთვლებისთვის ან სხვადასხვა ტიპის ოპერაციებისთვის



# 2. შექმენი 3 ცვლადი, სამივეში შეინახე განსხვავებული ინფორმაციის ტიპები, საბოლოოდ type() ფუნქციის გამოყენებით დაპრინტე მათი ტიპები.


# integer_variable = 10          # Integer ტიპი
# float_variable = 10.5          # Float ტიპი
# string_variable = "Hello"      # String ტიპი

# # ტიპების დაბეჭდვა
# print(type(integer_variable))  # <class 'int'>
# print(type(float_variable))    # <class 'float'>
# print(type(string_variable))   # <class 'str'>

# 3. მომხმარებელს Input()-ით შემოატანინე 2 რიცხვი და ამ ორ რიცხვზე გააკეთე გაყოფა, გამრავლება, მიმატება, გამოკლება (By Ilia Dzindzibadze).

# num1 = int(input("first number: "))
# num2 = int(input("second number: "))

# მიმატება = num1 + num2 
# გამოკლება = num1 - num2
# გამრავლება = num1 * num2
# გაყოფა = num1 / num2

# Medium:


# 3. შექმენი ცვლადი, რომელშიც თავიდან შეინახავ "5"-ს, შემდეგ ეს ცვლადი გადააქციე integer-ად და დაპრინტე.

# num_str = "5"

# nun_int = int(num_str)

# print(nun_int)  #5

# 4. შექმენი ცვლადი, რომელშიც თავიდან შეინახავ 6-ს, შემდეგ ეს ცვლადი გადააქციე float-ად და დაპრინტე (By Ilia Dzindzibadze).

# num = 6

# num_float = float(num)

# print(num_float )  #6.0

# 5. დაწერე კოდი, სადაც გამოიყენებ ორივე ტიპის გაყოფას (/ და //), დააკვირდი რა განსხვავებაა მათ შორის და დაწერე კომენტარში.

# num1 = 10
# num2 = 3

# result1 = num1 / num2
# print(result1) #3.3333333333333335

# result2 = num1 // num2
# print(result2) #3

# Hard:

# 6. მომხმარებელს input()-ით შემოატანინე ასაკი და ბოლოს დაუპრინტე, თუ რამდენი წლის იქნება 5 წლის შემდეგ (By Ilia Dzindzibadze).

# age = int(input("how old are you"))

# future_age = age + 5

# print(f"after 5 year you will be :{future_age}")

# 7. შექმენი 2 ცვლადი, პირველში მომხარებელს input()-ით შემოატანინე მისი სახელი, მეორეში გვარი, საბოლოოდ დაუპრინტე მისალმების მესიჯი, მაგალითად: 'გამარჯობა' + (სახელი) + (გვარი).Easy:

# # მომხმარებლის სახელი და გვარი
# first_name = input("შემოიტანეთ თქვენი სახელი: ")
# last_name = input("შემოიტანეთ თქვენი გვარი: ")

# # მისალმების მესიჯის დაბეჭდვა
# print("გამარჯობა,", first_name, last_name)


