# #1. პრინტის მეშვეობით გააკეთეთ 4-ივე არითმეტიკული ოპერაცია: შეკრება, გამოკლება, გამრავლება, გაყოფა.
print(1 + 2)
print(4 - 2)
print(5 * 7)
print(20 / 4)
# 2. დაწერეთ 5 არასწორი კოდი და კომენტარების მეშვეობით ახსენით, რატომ არის არასწორი.

name = andria  #არასწორია რადგან სტრინგი არის ბრჭყალების გარეშე


print(andria) # აქაც სტრინგი გვაქვს ბრჭყალების გარეშე


print(number)
number = 1  #ეს კოდი არ იმუსავებს რადგან ჯერ უნდა იყოს ცვლადი და შემდეგ პრინტ ფუნქცია

# 3. შექმენით ორ სიტყვიანი ცვლადი, სადაც შეინახავთ სტრინგს, შემდეგ კი დაპრინტეთ.
my_name = "andria"
print(my_name)


# 4. შექმენით ფაილი, სადაც კომენტარების ახსნით თუ რა არის კარგი პრაქტიკები და რისთვის ვიყენებთ მათ.